namespace Matriz___Atividade_14
{
    internal class Program
    {
        static void Main(string[] args)
        {
            int[,] numeros = new int[5, 5];

            int i = 0, p = 0, soma = 0;


            for (i=0; i<5; i++)
            {
                for (p=0; p<5; p++)
                {
                    Console.WriteLine("=========================================================================================================");
                    Console.WriteLine(" Digite o valor da Coordenada: ["+i+"]["+p+"]");
                    Console.WriteLine("---------------------------------------------------------------------------------------------------------");
                    numeros[p, i] = int.Parse(Console.ReadLine());

                }
            }

            Console.WriteLine("---------------------------------------------------------------------------------------------------------");

            for (i = 0; i<5; i++)
            {
                Console.Write("{ "+numeros[i,0]+","+numeros[i, 1]+","+numeros[i, 2]+","+numeros[i, 3]+","+numeros[i, 4]+ "} \n");
            }


            if (numeros[0, 0] == numeros[0, 4])
            {
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
                Console.WriteLine(" Os valores das Posições: [0,0] e [0,4] são os mesmos ");
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
            }
            if (numeros[1, 1] == numeros[1, 3])
            {
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
                Console.WriteLine(" Os valores das Posições: [1,1] e [1,3] são os mesmos ");
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
            }
            if (numeros[2, 2] == numeros[2, 2])
            {
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
                Console.WriteLine(" Os valores das Posições: [2,2] e [2,2] são os mesmos ");
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
            }
            if (numeros[3, 3] == numeros[3, 1])
            {
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
                Console.WriteLine(" Os valores das Posições: [3,3] e [3,1] são os mesmos ");
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
            }
            if (numeros[4, 4] == numeros[4, 0])
            {
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
                Console.WriteLine(" Os valores das Posições: [4,4] e [4,0] são os mesmos ");
                Console.WriteLine("---------------------------------------------------------------------------------------------------------");
            }

        }
    }
}